1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data using Pandas module.

In [2]:
import pandas as pd
import numpy as np

In [8]:
data = pd.array([1,2,3,4,5])

2. Write a Pandas program to convert a Panda module Series to Python list and it's type.

In [10]:
data.to_numpy()

array([1, 2, 3, 4, 5])

3. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.
Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [5]:
samp1=[2,4,6,8,10]
samp2=[1,3,5,7,9]

In [23]:
def arith(arr1,arr2):
    sum=0
    prod=0
    quot=0
    dif=0
    i=0
    for values in arr1:
        sum=+ values + arr2[i]
        prod+=values * arr2[i]
        quot=+ values / arr2[i]
        dif=+values - arr2[i]
        i+=1
    print("Sum= ", sum ," Product= " ,prod, "Quotient= ",quot," Difference= " , dif)

In [24]:
arith(samp1,samp2)

Sum=  19  Product=  190 Quotient=  1.1111111111111112  Difference=  1

4. Write a Pandas program to compare the elements of the two Pandas Series.
Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 10]

In [28]:
def comp(arr1,arr2):
    for i in arr1:
        if i == arr2[i]:
            continue
        else:
            return False
    return True

In [29]:
if comp(samp1,samp2):
    print("The 1D dfs are the same!")
else:
    print("The 1D dfs are different!")

The 1D dfs are different!

5. Write a Pandas program to convert a dictionary to a Pandas series. 
Sample Series: 
Original dictionary:
{'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}

Converted series:
a    100
b    200
c    300
d    400
e    800
dtype: int64

In [12]:
samp_d = {'a':100,'b':200,'c':300,'d':400,'e':800}
def to_diction(dict):
    df= pd.Series(samp_d)
    df.index.name = "chars"
    df.reset_index()
    return df

In [13]:
to_diction(samp_d)

chars
a    100
b    200
c    300
d    400
e    800
dtype: int64

6. Write a Pandas program to convert a NumPy array to a Pandas series. 
Sample Series: 
  NumPy array:
[10 20 30 40 50]
Converted Pandas series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [44]:
nparr=np.array([10 ,20, 30, 40, 50])
df = pd.DataFrame(nparr)
print(df)

    0
0  10
1  20
2  30
3  40
4  50

7. Write a Pandas program to change the data type of given a column or a Series. 
Sample Series: 
    Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
Change the said data type to numeric:
0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

In [49]:
df = df.astype(float)
df

      0
0  10.0
1  20.0
2  30.0
3  40.0
4  50.0

8. Write a Pandas program to convert the first column of a DataFrame as a Series. 
Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

1st column as a Series:
0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
df = pd.read_csv("spot.csv")

In [8]:
df_a=df.Artists
#I know this isn't the first col , but the first col was just ID numbers so, not as fun
df_a

0              Nature Sounds
1           Mambalam Sisters
2             Zen Life Relax
3        Device Sound Effect
4      Tibetan Singing Bowls
               ...
811                  Vanilla
812                 Re:Lilly
813          Jana Rychterová
814                Baby Band
815                  Mellina
Name: Artists, Length: 816, dtype: object

9. Write a Pandas program to convert a given Series to an array. 
Sample Output: 
Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
Series to an array
['100' '200' 'python' '300.12' '400']
<class 'numpy.ndarray'>

In [11]:
arr=df_a.to_numpy()

1.Write a Pandas program to create a dataframe from a dictionary and display it.
Sample data: {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
Expected Output:
    X   Y   Z                                                         
0  78  84  86                                                        
1  85  94  97                                                         
2  96  89  96                                                      
3  80  83  72                                                         
4  86  86  83

In [16]:
df_dict = pd.DataFrame.from_dict(samp_d,orient="index")

df_dict

     0
a  100
b  200
c  300
d  400
e  800

2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
   attempts       name qualify  score                              
a         1  Anastasia     yes   12.5                                 
b         3       Dima      no    9.0                                 
....                              
i         2      Kevin      no    8.0                                
j         1      Jonas     yes   19.0

In [72]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'] 
#Expected Output:    
#        attempts  name qualify  score
#a         1  Anastasia     yes   12.5
#b         3       Dima      no    9.0
#i         2      Kevin      no    8.0
#j         1      Jonas     yes   19

df_dict_plus = pd.DataFrame.from_dict(exam_data , orient="index", columns=labels)

In [73]:
df_dict_plus

,a,b,c,d,e,f,g,h,i,j
name,Anastasia,Dima,Katherine,James,Emily,Michael,Matthew,Laura,Kevin,Jonas
score,12.5,9,16.5,NaN,9,20,14.5,NaN,8,19
attempts,1,3,2,3,2,3,1,1,2,1
qualify,yes,no,yes,no,no,yes,yes,no,no,yes

3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
  Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
....
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

In [21]:
df.value_counts()

ID                      Name                                                Duration (Minutes)  Artists
001OiILKWTwe0sUUR2kQHV  Lesung Jumengglung (feat. Wulandari, Putri & Suji)  5                   Campursari Sangga Buana, Wulandari, Putri, Suji    1
5JCaWBCMRZS8bjD9jTJas0  Ankh Uthi Mohabat Ne                                28                  Nusrat Fateh Ali Khan                              1
5FuRa2RasMLVrkz68EXbXL  Deep Fear - Daniele Petronelli & Worp Remix         6                   Sidekick, Daniele Petronelli, Worp                 1
5FvHO7x2O9JCcMCp4Vayu1  Knights of Jerusalem                                5                   Dexter Ward                                        1
5G8CJVRlfK2zgO1tksC58z  Jäinen pääsiäinen                                   5                   NNS                                                1
                                                                                                                                                  ..
2mfTd0I9itWTliO8XGzFjh  Choral                                              5                   Andrea                                             1
2n3XcO8vMiMdV4uZQ3NKgN  Perverse Mind #1                                    5                   Tomohiko Sagae                                     1
2nU3IMWjgkxvtQeaMlyc9f  Breakmay                                            8                   Osvit                                              1
2na0H7wMDXpocnjCd2cbnI  Perspective                                         7                   Pragmatix                                          1
7zmWPThgrdIsvjqwUL4wD8  Luisa Maria                                         5                   Luis Miguel Del Amargue                            1
Name: count, Length: 816, dtype: int64

. Write a Pandas program to get the first 3 rows of a given DataFrame.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
First three rows of the data frame:                                   
   attempts       name qualify  score                              
a         1  Anastasia     yes   12.5                                 
b         3       Dima      no    9.0                                 
c         2  Katherine     yes   16.5

In [22]:
df.head(3)

,ID,Name,Duration (Minutes),Artists
0,026O2YP2wRl9h3Ht9ClZST,Steady Rain in a Forest with Light Background ...,100,Nature Sounds
1,0DXnjJxJBvgMvBjG6Jug7I,Soundarya Lahari,66,Mambalam Sisters
2,6BFn78qFy9bRqKHTMfhnNv,Waves of Abundance & Fullfillment,60,Zen Life Relax

5. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Select specific columns:                                               
        name  score                                                  
a  Anastasia   12.5                                                   
b       Dima    9.0                                                
c  Katherine   16.5                                                    
...                                                  
h      Laura    NaN                                                   
i      Kevin    8.0                                                  
j      Jonas   19.0

In [65]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [99]:
df_g = pd.DataFrame.from_dict(exam_data)

In [105]:
df_g[['name','score']]

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5
3      James    NaN
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
7      Laura    NaN
8      Kevin    8.0
9      Jonas   19.0

6. Write a Pandas program to select the specified columns and rows from a given data frame.
Sample Python dictionary data and list labels:
Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Select specific columns and rows:
   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

In [109]:
df_g.iloc[[0,2,4,5],[0,1]]

        name  score
0  Anastasia   12.5
2  Katherine   16.5
4      Emily    9.0
5    Michael   20.0

7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Number of attempts in the examination is greater than 2:
      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [118]:
filt = df_g['attempts'] >= 2
gb = df_g.where(filt)
gb.head()

        name  score  attempts qualify
0        NaN    NaN       NaN     NaN
1       Dima    9.0       3.0      no
2  Katherine   16.5       2.0     yes
3      James    NaN       3.0      no
4      Emily    9.0       2.0      no

8. Write a Pandas program to count the number of rows and columns of a DataFrame.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Number of Rows: 10                                                    
Number of Columns: 4

In [129]:
print("Amount of rows:",len(df_g.axes[0]))
print("Amount of cols:",len(df_g.axes[1]))

Amount of rows: 10
Amount of cols: 4

9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Rows where score is missing:
   attempts   name qualify  score
d         3  James      no    NaN
h         1  Laura      no    NaN

In [135]:
df_nan = df_g.where(df_g['score'].isna())
df_nan

    name  score  attempts qualify
0    NaN    NaN       NaN     NaN
1    NaN    NaN       NaN     NaN
2    NaN    NaN       NaN     NaN
3  James    NaN       3.0      no
4    NaN    NaN       NaN     NaN
5    NaN    NaN       NaN     NaN
6    NaN    NaN       NaN     NaN
7  Laura    NaN       1.0      no
8    NaN    NaN       NaN     NaN
9    NaN    NaN       NaN     NaN

10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [139]:
filter1=df_g['score'] >=15
filter2=df_g['score'] <=20
df_between=df_g.where(filter1 & filter2)

In [140]:
df_between

        name  score  attempts qualify
0        NaN    NaN       NaN     NaN
1        NaN    NaN       NaN     NaN
2  Katherine   16.5       2.0     yes
3        NaN    NaN       NaN     NaN
4        NaN    NaN       NaN     NaN
5    Michael   20.0       3.0     yes
6        NaN    NaN       NaN     NaN
7        NaN    NaN       NaN     NaN
8        NaN    NaN       NaN     NaN
9      Jonas   19.0       1.0     yes